function [L,U,x]=chase(a,c,d,b)
    n=length(a);
    n1=length(c);
    n2=length(d);
    %初始化
    L=zeros(n);%生成n*n的全零矩阵
    U=zeros(n);
    p=1:n;
    q=1:n-1;
    x=1:n;
    y=1:n;
    %追赶法程序主体
    p(1)=a(1);
    for i=1:n-1
        q(i)=c(i)/p(i);
        p(i+1)=a(i+1)-d(i)*q(i);%d的下标改为1到n-1
    end
    %正解y
    y(1)=b(1)/p(1);
    for i=2:n
        y(i)=(b(i)-d(i-1)*y(i-1))/p(i);
    end
    %倒解x
    x(n)=y(n);
    for i=(n-1):-1:1
        x(i)=y(i)-q(i)*x(i+1);
    end
    %L,U矩阵
    for i=1:n
        L(i,i)=p(i);
        U(i,i)=1;
    end
    for i=1:n-1
        L(i+1,i)=d(i);
        U(i,i+1)=q(i);
    end 
%以下为输入示例：(想要用追赶法求解，矩阵为[2,-1,0,0,0;-1,2,-1,0,0;0,-1,2,-1,0;0,0,-1,2,-1;0,0,0,-1,2]必须为三对角矩阵)
%a=[2,2,2,2,2]            %三对角矩阵A的主对角线元素
%c=[-1,-1,-1,-1,-1]       %三对角矩阵A的主对角线上边带宽为1的元素
%d=[-1,-1,-1,-1,-1]       %三对角矩阵A的主对角线下边带宽为1的元素
%b=[1;0;0;0;0]
%输入：[L,U,x]=chase(a,c,d,b)
%输出：L=.....,U=.....
%      x =[0.8333,0.6667,0.5000,0.3333,0.1667]
%制作：王子兴
%All rights reserved